import React from "react";
import './agreement.scss';

interface Props {
    openAgreement: boolean;
    onOpenAgreement: () => void;

}

const Agreement = ({onOpenAgreement, openAgreement}: Props) => (
    <>
        {openAgreement && (<div className="agreement">
            <h1 className="agreement__title">Угода користувача</h1>
            <h2 className="agreement__subtitle">(Умови використання сайту)</h2>
            <ol className="agreement__list">
                <li>
                    Терміни, які використовуються в тексті Угоди, мають таке значення:
                    <br/><br/>
                    <strong>Сайт</strong> – це сайт www.humanitarian.org.<br/>
                    <strong>Адміністрація</strong> – адміністрація сайту.<br/>
                    <strong>Користувач</strong> – особа, яка переглядає інформацію на сайті і/або залишає дані про
                    себе для перегляду інших користувачів.<br/>
                    <strong>Угода</strong> – ця угода та правила користування сайтом www.humanitarian.org.<br/>
                </li>
                <li>
                    Всі користувачі можуть переглядати зміст Сайту, ознайомлюватися з інформацією та матеріалами, а
                    також іншими даними, розміщеними на ньому.
                </li>
                <li>
                    Користуватися функціями Сайту, в тому числі додавати новини, волонтерів, підприємства та
                    оголошення.
                    <br/><br/>
                    3.1 Проставляючи галочку у відповідному полі у формі для заповнення на Сайті перед відправкою
                    своїх персональних даних користувач дає свою згоду адміністрації на збір і обробку (накопичення,
                    зберігання, адаптування, відновлення, використання, поширення, знеособлення і знищення)
                    зазначених ним даних, а саме: прізвище, ім’я, по батькові; номер телефону; електронна пошта;
                    місто; адреса; номери банківських карток; свої банківські реквізити; інші дані, з метою
                    подальшого розміщення цих даних на Сайті для перегляду інших користувачів та забезпечення
                    реалізації відносин у сфері реклами і маркетингових досліджень, а також дає свою згоду на
                    передачу (поширення) його даних іншим третім особам (без обмеження) на розсуд адміністрації.
                    <br/><br/>
                    Дане положення діє без обмеження терміну дії.
                    <br/><br/>
                    3.2 Джерелом збору персональних даних є інформація, яка безпосередньо і добровільно надана
                    користувачем.
                </li>
                <li>
                    Адміністрація Сайту залишає за собою виняткове право додавання або видалення будь-яких даних,
                    залишених користувачами на Сайті, на свій розсуд.
                </li>
                <li>
                    Користувач зобов’язується уважно ознайомитися з даною Угодою. У разі незгоди з умовами Угоди,
                    користувач зобов’язується негайно припинити використання Сайту.
                </li>
                <li>
                    Адміністрація в будь-який час без повідомлення користувачів може вносити зміни в цю Угоду, а
                    також в матеріали, інформацію та у будь-які інші дані.
                </li>
                <li>
                    У разі, якщо дані на сайті не відповідатимуть дійсності і користувач, не зробивши заходів для
                    перевірки таких даних, понесе будь-які збитки у зв’язку з цим, Сайт не несе відповідальності за
                    такі збитки.
                </li>
                <li>
                    Користувачі мають право переглядати і копіювати інформацію і матеріали з Сайту тільки для
                    особистого (некомерційного) використання, за умов повного дотримання законодавства в сфері
                    охорони інтелектуальної власності, інших вимог чинного законодавства України. Заборонено
                    комерційне та/або публічне використання матеріалів, інформації, інших даних, розміщених на
                    сайті. Будь-яке використання матеріалів, інформації, інших даних сайту на інших сайтах без згоди
                    правовласника заборонено.
                </li>
                <li>
                    Всі можливі суперечки, що випливають з цієї Угоди або пов’язані з нею, підлягають вирішенню
                    відповідно до чинного законодавства України.
                </li>
                <li>
                    Бездіяльність з боку адміністрації сайту в разі порушення будь-ким з користувачів положень Угоди
                    не позбавляє адміністрацію сайту права зробити пізніше відповідні дії на захист своїх інтересів
                    і захист авторських прав які охороняються відповідно до законодавства.
                </li>
            </ol>
            <br/>
            <span>Користувач <strong>підтверджує</strong>, що ознайомлений з усіма пунктами цієї угоди і <strong>безумовно приймає</strong> їх.</span>
            <button className="agreement__close" onClick={() => onOpenAgreement()}>Погоджуюсь</button>
        </div>)}
    </>
);


export default Agreement;
